app/controllers/level_plays_controller.rb

SELECT "level_plays".* FROM "level_plays"
---
  def index
    @level_plays = LevelPlay.all

INSERT INTO "level_plays" ("level_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["level_id", 1], ["user_id", 1], ["created_at", "2015-06-01 17:31:11.388558"], ["updated_at", "2015-06-01 17:31:11.388558"]]
---
  def create
    @level_play = current_user.level_plays.new(level_play_params)

    respond_to do |format|
      if @level_play.save

SELECT  "level_plays".* FROM "level_plays" WHERE "level_plays"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_level_play
      @level_play = LevelPlay.find(params[:id])