app/controllers/question_plays_controller.rb

INSERT INTO "question_plays" ("question_id", "answer_id", "level_play_id", "user_id", "created_at", "updated_at", "score") VALUES (?, ?, ?, ?, ?, ?, ?)  [["question_id", 1], ["answer_id", 3], ["level_play_id", 1], ["user_id", 1], ["created_at", "2015-06-02 13:58:39.541775"], ["updated_at", "2015-06-02 13:58:39.541775"], ["score", "1"]]
---
  def create
    @question_play = current_user.question_plays.new(question_play_params)
    if @question_play.save