app/controllers/tests_controller.rb

  def index
    @tests = Test.all
---
SELECT "tests".* FROM "tests"

    def set_test
      @test = Test.find(params[:id])
---
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT 1  [["id", 0]]